* Generators

#+BEGIN_SRC shell :results verbatim
rm -Rf out
mkdir out

echo "Copying assets"
cp assets/* out/

for page in pages/*; do 
  file=${page/pages\//}
  echo Processing $file;
  cat templates/header.html > out/$file
  cat $page >> out/$file
  cat templates/footer.html >> out/$file

  
done

#+END_SRC

#+RESULTS:
: Copying assets
: Processing index.html
: Processing links.html
: Processing livro.html
: Processing publicacoes.html
